WELCOME = "Привет!\n\nДля просмотра раписания необходимо представиться"
GROUP_EXAMPLE = "Напишите название вашей группы\n\nНапример «ПИ18-1»"
TEACHER_EXAMPLE = "Напишите ваше ФИО\n\nНапример «Коротеев Михаил Викторович»"
CHOOSE_MENU = "Выберите пункт из меню"
WRITE_DATE = (
    "Напишите дату, что бы получить ее расписание\n\nНапример «01.10.2019» или «01.10»"
)

WHAT_TO_SET = "Выберите, что требуется настроить"
WHAT_TO_FIND = "Выберите, что искать"

WRITE_GROUP = "Введите название группы"
WRITE_TEACHER = "Введите фамилию или ФИО преподавателя"

CHOOSE_GROUP = "Выберите нужную группу или попробуйте ввести еще раз"

SEARCHING_FOR_TEACHER = "Ищем преподавателя"
CHOOSE_CURRENT_TEACHER = "Выберите нужного преподавателя или попробуйте ввести еще раз"
TEACHER_NOT_FOUND = "Преподаватель не найден"

SEARCHING = "Поиск..."
CHOOSE_TIMEDELTA = "Выберите промежуток"
INCORRECT_DATE = "Неправильная дата"
INCORRECT_DATE_FORMAT = (
    "Не удалось добавить в рассылку расписания\nНеправильный формат даты"
)
CANT_FIND_USER = "Не удалось найти пользователя"
CANT_GET_SCHEDULE = "Не удалось получить расписание"
ERROR = "Ошибка"

CANT_FIND_SCHEDULE_BY_DATE = "Не удалось найти расписание на {}"
GROUP_CHANGED_FOR = "Группа изменена на «{}»"
GROUP = "Группа «{}»"
GROUP_NOT_FOUND = (
    "Группа «{}» не существует\n\nПроверьте название группы на http://ruz.fa.ru/ruz"
)
FOUND_TEACHER = "Найденный преподаватель: {}"
TEACHER_CHANGED_FOR = "Выбранный преподаватель: {}"

TODAY = "Сегодня"
TOMORROW = "Завтра"
THIS_WEEK = "Эта неделя"
NEXT_WEEK = "Следующая неделя"
CANCEL = "Отмена"

STUDENT = "Студент"
TEACHER = "Преподаватель"

SEARCH = "Поиск"
BACK = "Назад"
BACK_I = "← Назад"
SETTINGS = "Настройки"

SHOW_GROUPS = "Группы в расписании"
SHOW_LOCATION = "Корпус в расписании"

SUBSCRIBE_URL = "https://schedule.fa.ru/"

SUBSCRIBE_CHOICE_TIME_ONE = (
    "Напишите время в которое хотите получать раписание\nНапример: «12:35»"
)
SUBSCRIBE_CHOICE_TIME_TWO = "Или выберите ниже"
UNSUBSCRIBE_SCHEDULE = "Вы отписались от рассылки расписания"

DISPLAY_SCHEDULE = "Выберите, что вам следует показывать в расписании"

SELECT_DAY_IN_CALENDAR = "Выберите дату в календаре"

CALENDAR_MONTHS = [
    "Январь",
    "Февраль",
    "Март",
    "Апрель",
    "Май",
    "Июнь",
    "Июль",
    "Август",
    "Сентябрь",
    "Октябрь",
    "Ноябрь",
    "Декабрь",
]
CALENDAR_DAYS = [" Пн ", " Вт ", " Ср ", " Чт ", " Пт ", " Сб ", " Вс "]

MESSAGE_DELETED = "Сообщение уже удалено"
LOAD_SCHEDULE = "Загружаем расписание"
